//
//  Metro.swift
//  Bus Station
//
//  Created by Garry Yeung on 2020/11/24.
//

import Foundation

let MetroDestinationToLineDict: [String: [Station.Line]] = ["南港展覽館": [.BR, .BL], "動物園": [.BR], "淡水": [.R], "新北投": [.Rb], "北投": [.R, .Rb], "象山": [.R], "大安": [.R], "松山": [.G], "七張": [.Gb], "小碧潭": [.Gb], "新店": [.G], "台電大樓": [.G], "蘆洲": [.O], "迴龍": [.O], "南勢角": [.O], "頂埔": [.BL], "亞東醫院": [.BL], "新北產業園區": [.Y], "大坪林": [.Y]]

let WenHuStations = ["動物園", "木柵", "萬芳社區", "萬芳醫院", "辛亥", "麟光", "六張犁", "科技大樓", "大安", "忠孝復興", "南京復興", "中山國中", "松山機場", "大直", "劍南路", "西湖", "港墘", "文德", "內湖", "大湖公園", "葫洲", "東湖", "南港軟體園區", "南港展覽館"]
